TEXT_1 = "اهلين وياك بوت ميديا تريد فيديو لو صورة دز\nرابطهن وتدلل"
TEXT_2 = "مو ناوي تدلعني مثل البوتات\nترى ازعل منك اصيح المولاي يغصص بلاعيمك"
TEXT_3 = "من اشوف زبك يسعبل كسي وتذوب الروح انزل\nلعيرك ذليلة امصة ولباسي مشلوح"
TEXT_4 = "انزع لباسي الك وتنيكني يبعد كل طموح شكني\nبعيرك وضرطني العافيه ترى فدوة الك اروح"

RESPONSES = [TEXT_1, TEXT_2, TEXT_3, TEXT_4]

PROGRESS_START = "انتظر لأتمعن النظر على الرابط وتفقده\nسيتم ارسال الميديا"
PROGRESS_TEMPLATE = "انتظر لأتمعن النظر على الرابط وتفقده\nسيتم ارسال الميديا {percent}%"
ERROR_MESSAGE = "الرابط غير مدعوم او الموقع مو مدعوم\nشم كسي ويصير مدعوم ههع امزح دادي"
FILE_NOT_FOUND = ERROR_MESSAGE

SUCCESS_MESSAGE = "يدلل بعد كسي\nترى اموت بيك اعشقك هايمه بعيرك"
STARTUP_MESSAGE = "اشتغل البوت مرتلخ تاج راسي\nارضع عيرك ؟!"
QUEUE_FULL_MESSAGE = "سته عمليات داشتغل عليهم وبعدك تريد\nلعد شكد ملعوب بعرضك"

BTN_DEV = "تواصل مع المطور"
BTN_SUPPORT = "ابلاغ الدعم"

EMOJIS = ["🍕", "🌭", "🥪", "🥞", "🍣", "🍔"]
